lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
static constexpr uint8_t kChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kCoordinatorIeee =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_COORDINATOR_IEEE);
static constexpr uint64_t kExtendedPanId =
    static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_EXTENDED_PAN_ID);
static uint8_t g_activeNetworkKeySequence = 0x01U;
static uint8_t g_activeNetworkKey[16] = {0xA1U, 0xB2U, 0xC3U, 0xD4U,
                                         0xE5U, 0xF6U, 0x07U, 0x18U,
                                         0x29U, 0x3AU, 0x4BU, 0x5CU,
                                         0x6DU, 0x7EU, 0x8FU, 0x90U};
static uint8_t g_alternateNetworkKeySequence = 0U;
static uint8_t g_alternateNetworkKey[16] = {0U};
static bool g_haveAlternateNetworkKey = false;

bool persistCoordinatorSecurityState();
bool initializeCoordinatorFrameCounters();
bool allocateCoordinatorFrameCounter(ZigbeeOutgoingCounterDomain domain,
                                     uint32_t* outCounter);

#if NRF54L15_CLEAN_ZIGBEE_TX_DEBUG != 0
void printLastRadioTransmitDebug(const char* prefix) {
  const ZigbeeTransmitDebug debug = g_radio.lastTransmitDebug();
  Serial.print(prefix);
  Serial.print(" tx_len=");
  Serial.print(debug.txLength);
  Serial.print(" end=");
  Serial.print(debug.endSeen ? "yes" : "no");
  Serial.print(" disabled=");
  Serial.print(debug.disabledSeen ? "yes" : "no");
  Serial.print(" ack_req=");
  Serial.print(debug.ackRequested ? "yes" : "no");
  Serial.print(" ack_rx=");
  Serial.print(debug.ackReceived ? "yes" : "no");
  Serial.print(" ack_seq=0x");
  Serial.print(debug.ackSequence, HEX);
  Serial.print(" rx_len=");
  Serial.print(debug.rxLength);
  Serial.print(" rx_seq=0x");
  Serial.print(debug.rxSequence, HEX);
  Serial.print("\r\n");
}
#endif
static constexpr uint8_t kMaxNodes = 8U;
static constexpr uint8_t kPendingPayloadMax = 96U;
static constexpr uint8_t kZclCommandWriteAttributesResponse = 0x04U;
static constexpr uint8_t kZclCommandConfigureReportingResponse = 0x07U;
static constexpr uint8_t kZclCommandReadReportingConfigurationResponse = 0x09U;
static constexpr uint8_t kZclCommandReportAttributes = 0x0AU;
static constexpr uint8_t kZclCommandDefaultResponse = 0x0BU;
static constexpr uint8_t kZclCommandDiscoverAttributesExtendedResponse = 0x16U;
static constexpr uint8_t kOnOffCommandOff = 0x00U;
static constexpr uint8_t kOnOffCommandOn = 0x01U;
static constexpr uint8_t kOnOffCommandToggle = 0x02U;
static constexpr uint8_t kIdentifyCommandIdentify = 0x00U;
static constexpr uint8_t kIdentifyCommandIdentifyQuery = 0x01U;
static constexpr uint8_t kIdentifyCommandTriggerEffect = 0x40U;
static constexpr uint8_t kIdentifyEffectBlink = 0x00U;
static constexpr uint8_t kIdentifyEffectBreathe = 0x01U;
static constexpr uint8_t kIdentifyEffectChannelChange = 0x0BU;
static constexpr uint8_t kIdentifyEffectStopEffect = 0xFFU;
static constexpr uint8_t kGroupsCommandAddGroup = 0x00U;
static constexpr uint8_t kLevelControlCommandMoveToLevelWithOnOff = 0x04U;
static constexpr uint8_t kLevelControlCommandStepWithOnOff = 0x06U;
static constexpr uint8_t kColorControlCommandMoveToHue = 0x00U;
static constexpr uint8_t kColorControlCommandMoveToSaturation = 0x03U;
static constexpr uint8_t kColorControlCommandMoveToHueAndSaturation = 0x06U;
static constexpr uint8_t kColorControlCommandMoveToColorTemperature = 0x0AU;
static constexpr uint16_t kDemoGroupId = 0x1001U;
static constexpr uint32_t kPermitJoinWindowMs = 120000UL;
static constexpr uint32_t kRouterDirectDeliverRetryMs = 40UL;
static constexpr uint32_t kRouterPostAssocDeliverDelayUs = 6000UL;

struct PreconfiguredNodePolicy {
  uint64_t ieeeAddress;
  uint8_t installCode[18];
};

static const PreconfiguredNodePolicy kPreconfiguredNodePolicies[] = {
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_ONOFF_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_DIMMABLE_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_SENSOR_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_RGB_MOOD_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_RGBW_CEILING_LIGHT_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_TEMPERATURE_HUMIDITY_SENSOR_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_CLIMATE_BATTERY_SENSOR_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_15S_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_SLEEPY_CLIMATE_SENSOR_60S_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_SLEEPY_ROOM_SENSOR_15S_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_SLEEPY_ROOM_SENSOR_15S_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_SLEEPY_ROOM_SENSOR_60S_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_SLEEPY_ROOM_SENSOR_60S_INSTALL_CODE_BYTES}},
    {static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_IEEE),
     {NRF54L15_CLEAN_ZIGBEE_SLEEPY_ONOFF_BUTTON_INSTALL_CODE_BYTES}},
};

enum class NodeStage : uint8_t {
  kIdle = 0U,
  kAwaitingNodeDescriptor = 1U,
  kAwaitingPowerDescriptor = 2U,
  kAwaitingActiveEndpoints = 3U,
  kAwaitingSimpleDescriptor = 4U,
  kAwaitingBasicRead = 5U,
  kAwaitingReporting = 6U,
  kReady = 7U,
};

enum class TrustCenterNodeState : uint8_t {
  kIdle = 0U,
  kWaitingTransportKey = 1U,
  kJoined = 2U,
  kWaitingUpdateDevice = 3U,
  kAlternateKeyStaged = 4U,
};

struct PendingApsFrame {
  bool used = false;
  uint8_t deliveryMode = kZigbeeApsDeliveryUnicast;
  uint16_t destinationGroup = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t payloadLength = 0U;
  uint8_t payload[kPendingPayloadMax] = {0U};
};

