lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
struct PendingMacFrame {
  bool used = false;
  uint8_t length = 0U;
  uint8_t psdu[127] = {0U};
};

struct PendingApsAck {
  bool active = false;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t retriesRemaining = 0U;
  uint32_t deadlineMs = 0U;
  PendingApsFrame frame{};
};

struct RecentInboundAps {
  bool valid = false;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t deliveryMode = 0U;
  uint32_t expiresMs = 0U;
};

static constexpr uint8_t kPendingApsAckSlots = 3U;
static constexpr size_t kNodeTextMax = 33U;

struct NodeEntry {
  bool used = false;
  uint64_t ieeeAddress = 0U;
  uint16_t shortAddress = 0U;
  uint32_t lastSeenMs = 0U;
  bool secureNwkSeen = false;
  uint32_t lastInboundSecurityFrameCounter = 0U;
  uint8_t currentNetworkKeySequence = 0U;
  bool pendingTransportKey = false;
  bool pendingNetworkKeyUpdate = false;
  bool pendingSwitchKey = false;
  bool pendingLeaveWithRejoin = false;
  bool pendingSecureRejoin = false;
  bool pendingAssociationResponse = false;
  bool pendingNwkResponse = false;
  uint32_t lastDirectDeliverAttemptMs = 0U;
  uint16_t pendingAssignedShort = 0U;
  uint8_t pendingAssociationStatus = 0U;
  PendingApsFrame pending{};
  PendingMacFrame pendingMac{};
  PendingApsAck pendingApsAcks[kPendingApsAckSlots]{};
  RecentInboundAps recentInboundAps{};
  bool announced = false;
  bool haveNodeDescriptor = false;
  uint8_t logicalType = 0U;
  uint8_t macCapabilityFlags = 0U;
  uint16_t manufacturerCode = 0U;
  bool havePowerDescriptor = false;
  uint8_t availablePowerSources = 0U;
  uint8_t currentPowerSource = 0U;
  uint8_t currentPowerSourceLevel = 0U;
  bool haveBasicZclVersion = false;
  uint8_t basicZclVersion = 0U;
  bool haveBasicApplicationVersion = false;
  uint8_t basicApplicationVersion = 0U;
  bool haveBasicStackVersion = false;
  uint8_t basicStackVersion = 0U;
  bool haveBasicHwVersion = false;
  uint8_t basicHwVersion = 0U;
  bool haveBasicPowerSource = false;
  uint8_t basicPowerSource = 0U;
  char basicManufacturerName[kNodeTextMax] = {0};
  char basicModelIdentifier[kNodeTextMax] = {0};
  char basicSwBuildId[kNodeTextMax] = {0};
  uint8_t endpoint = 0U;
  uint16_t profileId = 0U;
  uint16_t deviceId = 0U;
  bool supportsOnOff = false;
  bool supportsLevelControl = false;
  bool supportsIdentify = false;
  bool supportsTemperature = false;
  bool supportsHumidity = false;
  bool supportsColorControl = false;
  bool supportsColorTemperature = false;
  bool supportsPowerConfiguration = false;
  bool haveIdentifyTime = false;
  uint16_t identifyTimeSeconds = 0U;
  bool basicRead = false;
  bool onOffBindingConfigured = false;
  bool levelBindingConfigured = false;
  bool temperatureBindingConfigured = false;
  bool humidityBindingConfigured = false;
  bool colorBindingConfigured = false;
  bool powerBindingConfigured = false;
  bool onOffReportingConfigured = false;
  bool levelReportingConfigured = false;
  bool temperatureReportingConfigured = false;
  bool humidityReportingConfigured = false;
  bool colorReportingConfigured = false;
  bool powerReportingConfigured = false;
  bool onOffReportingVerified = false;
  bool levelReportingVerified = false;
  bool temperatureReportingVerified = false;
  bool humidityReportingVerified = false;
  bool colorReportingVerified = false;
  bool powerReportingVerified = false;
  bool awaitingBindResponse = false;
  uint16_t awaitingClusterId = 0U;
  bool haveOnOffState = false;
  bool onOffState = false;
  bool haveLevelState = false;
  uint8_t levelState = 0U;
  bool haveTemperatureState = false;
  int16_t temperatureCentiDegrees = 0;
  bool haveHumidityState = false;
  uint16_t humidityCentiPercent = 0U;
  bool haveCurrentHue = false;
  uint8_t currentHue = 0U;
  bool haveCurrentSaturation = false;
  uint8_t currentSaturation = 0U;
  bool haveColorTemperature = false;
  uint16_t colorTemperatureMireds = 0U;
  bool haveBatteryVoltage = false;
  uint8_t batteryVoltageDecivolts = 0U;
  bool haveBatteryPercentage = false;
  uint8_t batteryPercentageRemainingHalf = 0U;
  bool demoGroupConfigured = false;
  uint8_t endDeviceTimeoutIndex = 0U;
  uint8_t endDeviceConfiguration = 0U;
  uint8_t parentInformation = 0U;
  bool endDeviceTimeoutNegotiated = false;
  ZigbeePreconfiguredKeyMode preconfiguredKeyMode =
      ZigbeePreconfiguredKeyMode::kNone;
  TrustCenterNodeState trustCenterState = TrustCenterNodeState::kIdle;
  NodeStage stage = NodeStage::kIdle;
  uint32_t stageDeadlineMs = 0U;
  uint8_t stageRetriesRemaining = 0U;
  uint8_t basicReadBatchIndex = 0U;
};

static constexpr uint32_t kApsAckTimeoutMs = 900U;
static constexpr uint32_t kRecentInboundApsWindowMs = 4000U;
static constexpr uint8_t kApsAckRetryLimit = 2U;
static constexpr uint32_t kInterviewRetryDelayMs = 1500UL;
static constexpr uint8_t kInterviewRetryLimit = 4U;
static constexpr uint32_t kPollFollowUpListenBudgetUs = 12000UL;

void processIncomingFrame(const ZigbeeFrame& frame);
void pumpImmediateResponseWindow(uint32_t listenBudgetUs);

bool sendApsFrameExtendedWithCounter(uint16_t destinationShort,
                                     uint8_t deliveryMode,
                                     uint16_t destinationGroup,
                                     uint8_t destinationEndpoint,
                                     uint16_t clusterId, uint16_t profileId,
                                     uint8_t sourceEndpoint,
                                     const uint8_t* payload,
                                     uint8_t payloadLength, uint8_t apsCounter,
                                     bool trackAck);
bool buildTransportKeyPsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength, uint8_t* outKeySequence,
                           bool* outNwkSecurityEnabled);
bool buildUpdateDevicePsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength);
bool sendPendingApsFrame(NodeEntry* node);
bool nodeUsesParentPolling(const NodeEntry& node);
bool maybeDeliverPendingDirect(NodeEntry* node, uint32_t nowMs,
                               bool immediateAfterAssoc = false);
bool queueNextReportingStep(NodeEntry* node);

static NodeEntry g_nodes[kMaxNodes] = {};
static uint16_t g_nextShortAddress = 0x1000U;

bool keyIsAllZero(const uint8_t key[16]) {
  if (key == nullptr) {
    return true;
  }
  uint8_t combined = 0U;
  for (uint8_t i = 0U; i < 16U; ++i) {
    combined = static_cast<uint8_t>(combined | key[i]);
  }
  return combined == 0U;
}

bool persistCoordinatorSecurityState() {
  ZigbeePersistentState state{};
  ZigbeePersistentStateStore::initialize(&state);
  state.channel = kChannel;
  state.logicalType = static_cast<uint8_t>(ZigbeeLogicalType::kCoordinator);
  state.panId = kPanId;
  state.nwkAddress = kCoordinatorShort;
  state.ieeeAddress = kCoordinatorIeee;
  state.extendedPanId = kExtendedPanId;
  memcpy(state.networkKey, g_activeNetworkKey, sizeof(state.networkKey));
  state.keySequence = g_activeNetworkKeySequence;
  state.flags = 0x01U | 0x02U | 0x04U;
  if (g_haveAlternateNetworkKey) {
    memcpy(state.alternateNetworkKey, g_alternateNetworkKey,
           sizeof(state.alternateNetworkKey));
    state.alternateKeySequence = g_alternateNetworkKeySequence;
    state.flags = static_cast<uint8_t>(state.flags | 0x08U);
  }
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    const NodeEntry& node = g_nodes[i];
    if (!node.used || node.ieeeAddress == 0U || node.shortAddress == 0U ||
        node.shortAddress == 0xFFFFU ||
        node.currentNetworkKeySequence == 0U ||
        node.trustCenterState != TrustCenterNodeState::kJoined) {
      continue;
    }
    ZigbeePersistentPeerSecurityState& peer = state.peerSecurity[i];
    peer.used = true;
    peer.ieeeAddress = node.ieeeAddress;
    peer.shortAddress = node.shortAddress;
    peer.incomingNwkFrameCounter = node.lastInboundSecurityFrameCounter;
    peer.networkKeySequence = node.currentNetworkKeySequence;
  }
  g_outgoingFrameCounters.stampPersistentState(&state);
  const bool saved = g_counterStore.save(state);
  if (!saved) {
    g_outgoingFrameCountersReady = false;
  }
  return saved;
}

bool initializeCoordinatorFrameCounters() {
  if (!g_counterStore.begin("zbcoordctr")) {
    return false;
  }

