lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  ZigbeePersistentState state{};
  const ZigbeePersistentLoadStatus status =
      g_counterStore.loadWithStatus(&state);
  if (status == ZigbeePersistentLoadStatus::kEmpty ||
      status == ZigbeePersistentLoadStatus::kTombstone) {
    CracenRng rng;
    if (!rng.fill(g_activeNetworkKey, sizeof(g_activeNetworkKey)) ||
        keyIsAllZero(g_activeNetworkKey)) {
      memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
      return false;
    }
    g_activeNetworkKeySequence = 1U;
    memset(g_alternateNetworkKey, 0, sizeof(g_alternateNetworkKey));
    g_alternateNetworkKeySequence = 0U;
    g_haveAlternateNetworkKey = false;
    g_outgoingFrameCounters.resetForNewKey(
        ZigbeeOutgoingCounterDomain::kNwk);
    g_outgoingFrameCounters.resetForNewKey(
        ZigbeeOutgoingCounterDomain::kApsTrustCenter);
    return persistCoordinatorSecurityState();
  }
  if (status != ZigbeePersistentLoadStatus::kLive ||
      state.logicalType !=
          static_cast<uint8_t>(ZigbeeLogicalType::kCoordinator) ||
      state.channel != kChannel || state.panId != kPanId ||
      state.nwkAddress != kCoordinatorShort ||
      state.ieeeAddress != kCoordinatorIeee ||
      state.extendedPanId != kExtendedPanId ||
      (state.flags & 0x04U) == 0U || state.keySequence == 0U ||
      keyIsAllZero(state.networkKey)) {
    return false;
  }

  memcpy(g_activeNetworkKey, state.networkKey, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = state.keySequence;
  g_haveAlternateNetworkKey = (state.flags & 0x08U) != 0U;
  if (g_haveAlternateNetworkKey) {
    if (state.alternateKeySequence == 0U ||
        state.alternateKeySequence == state.keySequence ||
        keyIsAllZero(state.alternateNetworkKey)) {
      return false;
    }
    memcpy(g_alternateNetworkKey, state.alternateNetworkKey,
           sizeof(g_alternateNetworkKey));
    g_alternateNetworkKeySequence = state.alternateKeySequence;
  }

  uint16_t nextShort = 0x1000U;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    const ZigbeePersistentPeerSecurityState& peer = state.peerSecurity[i];
    if (!peer.used) {
      continue;
    }
    if (peer.networkKeySequence != g_activeNetworkKeySequence &&
        (!g_haveAlternateNetworkKey ||
         peer.networkKeySequence != g_alternateNetworkKeySequence)) {
      return false;
    }
    for (uint8_t earlier = 0U; earlier < i; ++earlier) {
      if (state.peerSecurity[earlier].used &&
          (state.peerSecurity[earlier].ieeeAddress == peer.ieeeAddress ||
           state.peerSecurity[earlier].shortAddress == peer.shortAddress)) {
        return false;
      }
    }
    NodeEntry& node = g_nodes[i];
    node = NodeEntry{};
    node.used = true;
    node.ieeeAddress = peer.ieeeAddress;
    node.shortAddress = peer.shortAddress;
    node.secureNwkSeen = true;
    node.lastInboundSecurityFrameCounter = peer.incomingNwkFrameCounter;
    node.currentNetworkKeySequence = peer.networkKeySequence;
    node.announced = true;
    node.trustCenterState = TrustCenterNodeState::kJoined;
    if (peer.shortAddress >= nextShort && peer.shortAddress < 0xFFFEU) {
      nextShort = static_cast<uint16_t>(peer.shortAddress + 1U);
    }
  }
  g_nextShortAddress = nextShort;
  g_outgoingFrameCounters.restore(state);
  return g_outgoingFrameCounters.enabled(ZigbeeOutgoingCounterDomain::kNwk) &&
         g_outgoingFrameCounters.enabled(
             ZigbeeOutgoingCounterDomain::kApsTrustCenter);
}

bool allocateCoordinatorFrameCounter(ZigbeeOutgoingCounterDomain domain,
                                     uint32_t* outCounter) {
  if (!g_outgoingFrameCountersReady ||
      !g_outgoingFrameCounters.allocate(domain, &g_counterStore, outCounter)) {
    g_outgoingFrameCountersReady = false;
    return false;
  }
  return true;
}

NodeEntry* findNodeByIeee(uint64_t ieeeAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].ieeeAddress == ieeeAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeByShort(uint16_t shortAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress == shortAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeForDataRequest(const ZigbeeMacFrame& frame) {
  if (frame.source.mode == ZigbeeMacAddressMode::kExtended) {
    return findNodeByIeee(frame.source.extendedAddress);
  }

  if (frame.source.mode == ZigbeeMacAddressMode::kShort) {
    return findNodeByShort(frame.source.shortAddress);
  }

  return nullptr;
}

NodeEntry* allocateNode(uint64_t ieeeAddress) {
  NodeEntry* existing = findNodeByIeee(ieeeAddress);
  if (existing != nullptr) {
    return existing;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      g_nodes[i] = NodeEntry{};
      g_nodes[i].used = true;
      g_nodes[i].ieeeAddress = ieeeAddress;
      return &g_nodes[i];
    }
  }
  return nullptr;
}

uint16_t allocateShortAddress() {
  while (findNodeByShort(g_nextShortAddress) != nullptr ||
         g_nextShortAddress == 0x0000U || g_nextShortAddress == 0xFFFFU) {
    ++g_nextShortAddress;
  }
  return g_nextShortAddress++;
}

const char* nodeStageName(NodeStage stage) {
  switch (stage) {
    case NodeStage::kIdle:
      return "idle";
    case NodeStage::kAwaitingNodeDescriptor:
      return "node_desc";
    case NodeStage::kAwaitingPowerDescriptor:
      return "power_desc";
    case NodeStage::kAwaitingActiveEndpoints:
      return "active_ep";
    case NodeStage::kAwaitingSimpleDescriptor:
      return "simple_desc";
    case NodeStage::kAwaitingBasicRead:
      return "basic_read";
    case NodeStage::kAwaitingReporting:
      return "reporting";
    case NodeStage::kReady:
      return "ready";
  }
  return "unknown";
}

void markInterviewStage(NodeEntry* node, NodeStage stage) {
  if (node == nullptr) {
    return;
  }
  if (node->stage != stage) {
    node->stageRetriesRemaining = kInterviewRetryLimit;
  }
  node->stage = stage;
  node->stageDeadlineMs = millis() + kInterviewRetryDelayMs;
}

const uint8_t* findInstallCodeForNode(uint64_t ieeeAddress) {
  for (uint8_t i = 0U;
       i < static_cast<uint8_t>(sizeof(kPreconfiguredNodePolicies) /
                                sizeof(kPreconfiguredNodePolicies[0]));
       ++i) {
    if (kPreconfiguredNodePolicies[i].ieeeAddress == 0U) {
      continue;
    }
    if (kPreconfiguredNodePolicies[i].ieeeAddress == ieeeAddress) {
      return kPreconfiguredNodePolicies[i].installCode;
    }
  }
  return nullptr;
}

bool resolveTrustCenterLinkKey(NodeEntry* node, uint8_t outKey[16],
                               ZigbeePreconfiguredKeyMode* outMode) {
  if (node == nullptr || outKey == nullptr || outMode == nullptr) {
    return false;
  }

