lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  const uint8_t* installCode = findInstallCodeForNode(node->ieeeAddress);
  if (installCode != nullptr &&
      ZigbeeSecurity::deriveInstallCodeLinkKey(installCode, 18U, outKey, 16U)) {
    *outMode = ZigbeePreconfiguredKeyMode::kInstallCodeDerived;
    return true;
  }

#if !NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
  return false;
#else
  if (!ZigbeeSecurity::loadZigbeeAlliance09LinkKey(outKey, 16U)) {
    return false;
  }
  *outMode = ZigbeePreconfiguredKeyMode::kWellKnown;
  return true;
#endif
}

bool secureRejoinAllowed(const NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
#if NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
  return ZigbeeCommissioning::isUniqueLinkKeyMode(node->preconfiguredKeyMode);
#else
  return node->preconfiguredKeyMode != ZigbeePreconfiguredKeyMode::kNone;
#endif
}

const char* trustCenterStateName(TrustCenterNodeState state) {
  switch (state) {
    case TrustCenterNodeState::kWaitingTransportKey:
      return "waiting_transport_key";
    case TrustCenterNodeState::kJoined:
      return "joined";
    case TrustCenterNodeState::kWaitingUpdateDevice:
      return "waiting_update_device";
    case TrustCenterNodeState::kAlternateKeyStaged:
      return "alternate_key_staged";
    case TrustCenterNodeState::kIdle:
    default:
      return "idle";
  }
}

const uint8_t* keyForSequence(uint8_t keySequence) {
  if (keySequence == g_activeNetworkKeySequence) {
    return g_activeNetworkKey;
  }
  if (g_haveAlternateNetworkKey &&
      keySequence == g_alternateNetworkKeySequence) {
    return g_alternateNetworkKey;
  }
  return nullptr;
}

void clearAlternateNetworkKey() {
  memset(g_alternateNetworkKey, 0, sizeof(g_alternateNetworkKey));
  g_alternateNetworkKeySequence = 0U;
  g_haveAlternateNetworkKey = false;
}

[[maybe_unused]] bool deriveAlternateNetworkKey() {
  if (g_haveAlternateNetworkKey) {
    return true;
  }

  const uint8_t nextSequence =
      (g_activeNetworkKeySequence == 0xFFU)
          ? 0x01U
          : static_cast<uint8_t>(g_activeNetworkKeySequence + 1U);
  uint8_t candidate[sizeof(g_alternateNetworkKey)] = {0U};
  CracenRng rng;
  if (!rng.fill(candidate, sizeof(candidate)) || keyIsAllZero(candidate)) {
    return false;
  }
  if (memcmp(candidate, g_activeNetworkKey, sizeof(candidate)) == 0) {
    memset(candidate, 0, sizeof(candidate));
    return false;
  }
  memcpy(g_alternateNetworkKey, candidate, sizeof(g_alternateNetworkKey));
  memset(candidate, 0, sizeof(candidate));
  g_alternateNetworkKeySequence = nextSequence;
  g_haveAlternateNetworkKey = true;
  if (!persistCoordinatorSecurityState()) {
    clearAlternateNetworkKey();
    return false;
  }
  return true;
}

void maybePromoteAlternateNetworkKey() {
  if (!g_haveAlternateNetworkKey) {
    return;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used || g_nodes[i].shortAddress == 0U) {
      continue;
    }
    if (g_nodes[i].currentNetworkKeySequence != g_alternateNetworkKeySequence) {
      return;
    }
  }

  memcpy(g_activeNetworkKey, g_alternateNetworkKey, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = g_alternateNetworkKeySequence;
  clearAlternateNetworkKey();
  g_outgoingFrameCounters.resetForNewKey(
      ZigbeeOutgoingCounterDomain::kNwk);
  g_outgoingFrameCountersReady = persistCoordinatorSecurityState();
  Serial.print("nwk_key_promoted seq=");
  Serial.print(g_activeNetworkKeySequence);
  Serial.print("\r\n");
}

bool sendPsdu(const uint8_t* psdu, uint8_t length) {
  const bool sent = g_radio.transmit(psdu, length, false, 1200000UL);
#if NRF54L15_CLEAN_ZIGBEE_TX_DEBUG != 0
  if (!sent) {
    printLastRadioTransmitDebug("mac_tx_fail");
  }
#endif
  return sent;
}

bool lastMacTxLooksDeliveredButUnacked() {
  const ZigbeeTransmitDebug debug = g_radio.lastTransmitDebug();
  return debug.endSeen && debug.disabledSeen && debug.ackRequested &&
         !debug.ackReceived;
}

bool sendBeacon() {
  ZigbeeMacBeaconPayload payload{};
  payload.valid = true;
  payload.protocolId = 0U;
  payload.stackProfile = 2U;
  payload.protocolVersion = 2U;
  payload.panCoordinator = true;
  payload.associationPermit = g_permitJoinEnabled;
  payload.routerCapacity = true;
  payload.endDeviceCapacity = true;
  payload.extendedPanId = kExtendedPanId;
  payload.txOffset = 0x00FFFFFFUL;
  payload.updateId = 0U;

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  if (!ZigbeeCodec::buildBeaconFrame(g_macSequence++, kPanId,
                                     kCoordinatorShort, payload, frame,
                                     &length)) {
    return false;
  }
  return sendPsdu(frame, length);
}

bool sendCoordinatorRealignment(NodeEntry* node) {
  if (node == nullptr || node->ieeeAddress == 0U || node->shortAddress == 0U) {
    return false;
  }

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  if (!ZigbeeCodec::buildCoordinatorRealignment(
          g_macSequence++, kPanId, kCoordinatorShort, kChannel,
          node->shortAddress, node->ieeeAddress, frame, &length)) {
    return false;
  }
  return sendPsdu(frame, length);
}

bool queuePendingApsFrameExtended(NodeEntry* node, uint8_t deliveryMode,
                                  uint16_t destinationGroup,
                                  uint16_t clusterId, uint16_t profileId,
                                  uint8_t destinationEndpoint,
                                  uint8_t sourceEndpoint,
                                  const uint8_t* payload,
                                  uint8_t payloadLength) {
  if (node == nullptr) {
    return false;
  }
  if (payloadLength > 0U && payload == nullptr) {
    return false;
  }
  if (node->pendingAssociationResponse || node->pendingTransportKey ||
      node->pendingSwitchKey || node->pending.used ||
      payloadLength > kPendingPayloadMax) {
    return false;
  }

  node->pending.used = true;
  node->pending.deliveryMode = deliveryMode;
  node->pending.destinationGroup = destinationGroup;
  node->pending.clusterId = clusterId;
  node->pending.profileId = profileId;
  node->pending.destinationEndpoint = destinationEndpoint;
  node->pending.sourceEndpoint = sourceEndpoint;
  node->pending.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(node->pending.payload, payload, payloadLength);
  }
  return true;
}

bool queuePendingApsFrame(NodeEntry* node, uint16_t clusterId,
                          uint16_t profileId, uint8_t destinationEndpoint,
                          uint8_t sourceEndpoint, const uint8_t* payload,
                          uint8_t payloadLength) {
  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryUnicast, 0U, clusterId, profileId,
      destinationEndpoint, sourceEndpoint, payload, payloadLength);
}

void clearPendingApsAck(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  memset(node->pendingApsAcks, 0, sizeof(node->pendingApsAcks));
}

void clearPendingApsAckSlot(NodeEntry* node, uint8_t slot) {
  if (node == nullptr || slot >= kPendingApsAckSlots) {
    return;
  }
  node->pendingApsAcks[slot] = PendingApsAck{};
}

bool nodeHasPendingApsAck(const NodeEntry& node) {
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (node.pendingApsAcks[i].active) {
      return true;
    }
  }
  return false;
}

bool matchesPendingApsAck(const PendingApsAck& pending,
                          const ZigbeeApsAcknowledgementFrame& ack) {
  return pending.active && ack.valid && !ack.ackFormatCommand &&
         ack.counter == pending.counter &&
         ack.clusterId == pending.clusterId &&
         ack.profileId == pending.profileId &&
         ack.destinationEndpoint == pending.sourceEndpoint &&
         ack.sourceEndpoint == pending.destinationEndpoint;
}

bool findPendingApsAckSlot(const NodeEntry& node,
                           const ZigbeeApsAcknowledgementFrame& ack,
                           uint8_t* outSlot) {
  if (outSlot == nullptr) {
    return false;
  }

  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (matchesPendingApsAck(node.pendingApsAcks[i], ack)) {
      *outSlot = i;
      return true;
    }
  }
  return false;
}

bool pendingApsAckSlotAvailable(const NodeEntry& node, uint32_t nowMs) {
  for (uint8_t i = 0U; i < kPendingApsAckSlots; ++i) {
    if (!node.pendingApsAcks[i].active ||
        static_cast<int32_t>(nowMs - node.pendingApsAcks[i].deadlineMs) >= 0) {
      return true;
    }
  }
  return false;
}

bool resendPendingApsFrame(NodeEntry* node, uint8_t slot);

