lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool sendUpdateDevice(NodeEntry* node) {
  uint8_t psdu[127] = {0U};
  uint8_t psduLength = 0U;
  if (!buildUpdateDevicePsdu(node, psdu, &psduLength)) {
    return false;
  }
  return sendPsdu(psdu, psduLength);
}

bool buildUpdateDevicePsdu(NodeEntry* node, uint8_t* outPsdu,
                           uint8_t* outPsduLength) {
  if (node == nullptr || node->shortAddress == 0U || node->ieeeAddress == 0U) {
    Serial.print("update_device FAIL stage=invalid_node\r\n");
    return false;
  }
  if (outPsdu == nullptr || outPsduLength == nullptr) {
    return false;
  }
  *outPsduLength = 0U;
  if (!secureRejoinAllowed(node) ||
      node->trustCenterState != TrustCenterNodeState::kWaitingUpdateDevice) {
    Serial.print("update_device FAIL stage=state short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" tc=");
    Serial.print(trustCenterStateName(node->trustCenterState));
    Serial.print(" lk=");
    Serial.print(ZigbeeCommissioning::keyModeName(node->preconfiguredKeyMode));
    Serial.print("\r\n");
    return false;
  }

  uint8_t linkKey[16] = {0U};
  ZigbeePreconfiguredKeyMode keyMode = ZigbeePreconfiguredKeyMode::kNone;
  if (!resolveTrustCenterLinkKey(node, linkKey, &keyMode)) {
    Serial.print("update_device FAIL stage=resolve_link_key short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }
  node->preconfiguredKeyMode = keyMode;

  ZigbeeApsUpdateDevice updateDevice{};
  updateDevice.valid = true;
  updateDevice.deviceIeee = node->ieeeAddress;
  updateDevice.deviceShort = node->shortAddress;
  updateDevice.status = kZigbeeApsUpdateDeviceStatusStandardSecureRejoin;

  uint8_t apsFrame[127] = {0U};
  uint8_t apsLength = 0U;
  ZigbeeApsSecurityHeader apsSecurity{};
  apsSecurity.valid = true;
  apsSecurity.securityControl = kZigbeeSecurityControlApsEncMic32;
  if (!allocateCoordinatorFrameCounter(
          ZigbeeOutgoingCounterDomain::kApsTrustCenter,
          &apsSecurity.frameCounter)) {
    return false;
  }
  apsSecurity.sourceIeee = kCoordinatorIeee;
  if (!ZigbeeSecurity::buildSecuredApsUpdateDeviceCommand(
          updateDevice, apsSecurity, linkKey, g_apsCounter++, apsFrame,
          &apsLength)) {
    Serial.print("update_device FAIL stage=build_aps short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }

  ZigbeeNetworkFrame nwk{};
  nwk.frameType = ZigbeeNwkFrameType::kData;
  nwk.securityEnabled = true;
  nwk.destinationShort = node->shortAddress;
  nwk.sourceShort = kCoordinatorShort;
  nwk.radius = 30U;
  nwk.sequence = g_nwkSequence++;

  uint8_t nwkFrame[127] = {0U};
  uint8_t nwkLength = 0U;
  ZigbeeNwkSecurityHeader security{};
  security.valid = true;
  security.securityControl = kZigbeeSecurityControlNwkEncMic32;
  if (!allocateCoordinatorFrameCounter(
          ZigbeeOutgoingCounterDomain::kNwk,
          &security.frameCounter)) {
    return false;
  }
  security.sourceIeee = kCoordinatorIeee;
  const uint8_t keySequence =
      (node->currentNetworkKeySequence != 0U) ? node->currentNetworkKeySequence
                                              : g_activeNetworkKeySequence;
  const uint8_t* networkKey = keyForSequence(keySequence);
  if (networkKey == nullptr) {
    Serial.print("update_device FAIL stage=network_key short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" seq=");
    Serial.print(keySequence);
    Serial.print("\r\n");
    return false;
  }
  security.keySequence = keySequence;
  if (!ZigbeeSecurity::buildSecuredNwkFrame(nwk, security, networkKey,
                                            apsFrame, apsLength, nwkFrame,
                                            &nwkLength)) {
    Serial.print("update_device FAIL stage=build_nwk short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }

  if (!ZigbeeRadio::buildDataFrameShort(g_macSequence++, kPanId,
                                        node->shortAddress, kCoordinatorShort,
                                        nwkFrame, nwkLength, outPsdu,
                                        outPsduLength, false)) {
    Serial.print("update_device FAIL stage=build_mac short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print("\r\n");
    return false;
  }
  Serial.print("update_device prepared short=0x");
  Serial.print(node->shortAddress, HEX);
  Serial.print(" len=");
  Serial.print(*outPsduLength);
  Serial.print(" seq=");
  Serial.print(keySequence);
  Serial.print("\r\n");
  return true;
}

bool sendPendingAssociationResponse(NodeEntry* node) {
  if (node == nullptr || !node->pendingAssociationResponse) {
    return false;
  }

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  const bool built = ZigbeeCodec::buildAssociationResponse(
      g_macSequence++, kPanId, node->ieeeAddress, kCoordinatorShort,
      node->pendingAssignedShort, node->pendingAssociationStatus, frame, &length);
  if (!built) {
    return false;
  }
  bool sent = sendPsdu(frame, length);
  if (!sent && node->pendingAssociationStatus == 0x00U) {
    // Some sleepy end-device association responses land on-air but the
    // immediate MAC ACK is still missed. If TX completed cleanly, keep the
    // assigned short and allow the next poll / secured follow-up to prove the
    // node is actually alive.
    if (lastMacTxLooksDeliveredButUnacked()) {
      sent = true;
      Serial.print("assoc_rsp soft_ok short=0x");
      Serial.print(node->pendingAssignedShort, HEX);
      Serial.print(" ack=MISS\r\n");
    }
  }
  if (sent) {
    node->pendingAssociationResponse = false;
    node->shortAddress = node->pendingAssignedShort;
    node->lastSeenMs = millis();
    if (node->pendingAssociationStatus == 0x00U) {
      // Sleepy end devices that factory-reset and rejoin through normal MAC
      // association need a fresh Transport Key, not an Update Device. Keep
      // the retained secure-rejoin shortcut only for always-on devices; sleepy
      // rejoin is already handled by orphan recovery / NWK rejoin.
      if (node->pendingSecureRejoin && secureRejoinAllowed(node) &&
          !nodeUsesParentPolling(*node)) {
        node->trustCenterState = TrustCenterNodeState::kWaitingUpdateDevice;
        node->pendingMac.used = buildUpdateDevicePsdu(
            node, node->pendingMac.psdu, &node->pendingMac.length);
        Serial.print("assoc_rejoin short=0x");
        Serial.print(node->shortAddress, HEX);
        Serial.print(" tc=");
        Serial.print(trustCenterStateName(node->trustCenterState));
        Serial.print(" prepared=");
        Serial.print(node->pendingMac.used ? "yes" : "no");
        Serial.print("\r\n");
      } else {
        node->pendingSecureRejoin = false;
        (void)queuePendingTransportKey(node);
      }
      if (!nodeUsesParentPolling(*node)) {
        (void)maybeDeliverPendingDirect(node, millis(), true);
      }
    }
  }
  return sent;
}

bool sendPendingApsFrame(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  if (node->pendingTransportKey) {
    bool sent =
        node->pendingMac.used ? sendPsdu(node->pendingMac.psdu, node->pendingMac.length)
                              : sendTransportKey(node);
    if (!sent && nodeUsesParentPolling(*node) &&
        node->pendingAssociationStatus == 0x00U &&
        lastMacTxLooksDeliveredButUnacked()) {
      sent = true;
      Serial.print("transport_key soft_ok short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ack=MISS\r\n");
    }
    if (node->pendingMac.used) {
      Serial.print("transport_key ");
      Serial.print(sent ? "OK" : "FAIL");
      Serial.print(" stage=prepared_tx short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" len=");
      Serial.print(node->pendingMac.length);
      Serial.print("\r\n");
    }
    if (sent) {
      node->pendingTransportKey = false;
      node->pendingMac.used = false;
      if (node->pendingNetworkKeyUpdate) {
        node->pendingNetworkKeyUpdate = false;
        node->pendingSwitchKey = true;
        node->trustCenterState = TrustCenterNodeState::kAlternateKeyStaged;
      } else {
        node->currentNetworkKeySequence = g_activeNetworkKeySequence;
        node->lastInboundSecurityFrameCounter = 0U;
        node->trustCenterState = TrustCenterNodeState::kJoined;
      }
      if (!persistCoordinatorSecurityState()) {
        return false;
      }
    }
    return sent;
  }
  if (node->pendingSwitchKey) {
    const bool sent = sendSwitchKey(node);
    if (sent) {
      node->pendingSwitchKey = false;
      node->currentNetworkKeySequence = g_alternateNetworkKeySequence;
      node->lastInboundSecurityFrameCounter = 0U;
      node->trustCenterState = TrustCenterNodeState::kJoined;
      maybePromoteAlternateNetworkKey();
      if (!persistCoordinatorSecurityState()) {
        return false;
      }
    }
    return sent;
  }
  if (node->pendingSecureRejoin) {
    bool sent =
        node->pendingMac.used ? sendPsdu(node->pendingMac.psdu, node->pendingMac.length)
                              : sendUpdateDevice(node);
    if (!sent && lastMacTxLooksDeliveredButUnacked()) {
      sent = true;
      Serial.print("update_device soft_ok short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ack=MISS\r\n");
    }
    if (sent) {
      node->pendingSecureRejoin = false;
      node->pendingMac.used = false;
      node->pendingMac.length = 0U;
      node->trustCenterState = TrustCenterNodeState::kJoined;
    }
    return sent;
  }
  if (!node->pending.used) {
    return false;
  }
  if (node->pending.deliveryMode == kZigbeeApsDeliveryUnicast &&
      !pendingApsAckSlotAvailable(*node, millis())) {
    return false;
  }

