lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void maybeRetryInterviewStage(NodeEntry* node, uint32_t nowMs) {
  if (node == nullptr || node->shortAddress == 0U) {
    return;
  }
  switch (node->stage) {
    case NodeStage::kAwaitingNodeDescriptor:
    case NodeStage::kAwaitingPowerDescriptor:
    case NodeStage::kAwaitingActiveEndpoints:
    case NodeStage::kAwaitingSimpleDescriptor:
    case NodeStage::kAwaitingBasicRead:
      break;
    default:
      return;
  }

  if (node->pending.used || node->pendingAssociationResponse ||
      node->pendingTransportKey || node->pendingSecureRejoin ||
      node->pendingSwitchKey || node->pendingNwkResponse ||
      nodeHasPendingApsAck(*node)) {
    return;
  }
  if (node->stageDeadlineMs == 0U ||
      static_cast<int32_t>(nowMs - node->stageDeadlineMs) < 0) {
    return;
  }
  if (node->stageRetriesRemaining == 0U) {
    Serial.print("interview_timeout short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" stage=");
    Serial.print(nodeStageName(node->stage));
    Serial.print("\r\n");
    if (node->stage == NodeStage::kAwaitingBasicRead) {
      node->basicRead = true;
      if (!queueNextReportingStep(node)) {
        node->stage = NodeStage::kReady;
      }
    }
    node->stageDeadlineMs = 0U;
    return;
  }

  (void)retryInterviewStage(node);
}

bool queueOnOffConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterOnOff;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kBoolean;
  configuration.minimumIntervalSeconds = 0U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 0U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterOnOff,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterOnOff;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueBindRequest(NodeEntry* node, uint16_t clusterId) {
  if (node == nullptr || node->endpoint == 0U || node->ieeeAddress == 0U) {
    return false;
  }

  uint8_t payload[32] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildZdoBindRequest(
          g_zdoSequence++, node->ieeeAddress, node->endpoint, clusterId,
          ZigbeeBindingAddressMode::kExtended, 0U, kCoordinatorIeee,
          kCoordinatorEndpoint, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeZdoBindRequest, kZigbeeProfileZdo, 0U,
                           0U, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = true;
    node->awaitingClusterId = clusterId;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueMgmtLeaveRequest(NodeEntry* node, bool requestRejoin = false) {
  if (node == nullptr || node->ieeeAddress == 0U) {
    return false;
  }

  uint8_t payload[16] = {0U};
  uint8_t payloadLength = 0U;
  const uint8_t leaveFlags =
      requestRejoin ? kZigbeeMgmtLeaveFlagRejoin : 0x00U;
  if (!ZigbeeCodec::buildZdoMgmtLeaveRequest(
          g_zdoSequence++, node->ieeeAddress, leaveFlags, payload,
          &payloadLength)) {
    return false;
  }
  const bool queued = queuePendingApsFrame(node, kZigbeeZdoMgmtLeaveRequest,
                                           kZigbeeProfileZdo, 0U, 0U, payload,
                                           payloadLength);
  if (queued) {
    node->pendingLeaveWithRejoin = requestRejoin;
  }
  return queued;
}

bool queueLevelConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterLevelControl;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kUint8;
  configuration.minimumIntervalSeconds = 0U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 16U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterLevelControl;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

bool queueTemperatureConfigureReporting(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsTemperature) {
    return false;
  }
  ZigbeeReportingConfiguration configuration{};
  configuration.used = true;
  configuration.clusterId = kZigbeeClusterTemperatureMeasurement;
  configuration.attributeId = 0x0000U;
  configuration.dataType = ZigbeeZclDataType::kInt16;
  configuration.minimumIntervalSeconds = 5U;
  configuration.maximumIntervalSeconds = 60U;
  configuration.reportableChange = 25U;

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildConfigureReportingRequest(
          &configuration, 1U, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }
  const bool queued =
      queuePendingApsFrame(node, kZigbeeClusterTemperatureMeasurement,
                           kZigbeeProfileHomeAutomation, node->endpoint,
                           kCoordinatorEndpoint, payload, payloadLength);
  if (queued) {
    node->awaitingBindResponse = false;
    node->awaitingClusterId = kZigbeeClusterTemperatureMeasurement;
    node->stage = NodeStage::kAwaitingReporting;
  }
  return queued;
}

