lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildWriteAttributesRequest(&record, 1U, g_zclSequence++,
                                                payload, &payloadLength,
                                                noResponse)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyWriteAttributeUndivided(NodeEntry* node,
                                          uint16_t identifyTimeSeconds,
                                          bool injectReadOnlyFailure) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  ZigbeeWriteAttributeRecord records[2];
  memset(records, 0, sizeof(records));
  records[0].attributeId = 0x0000U;
  records[0].value.type = ZigbeeZclDataType::kUint16;
  records[0].value.data.u16 = identifyTimeSeconds;

  uint8_t recordCount = 1U;
  if (injectReadOnlyFailure) {
    records[1].attributeId = 0xFFFCU;
    records[1].value.type = ZigbeeZclDataType::kBitmap32;
    records[1].value.data.u32 = 0U;
    recordCount = 2U;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  if (!ZigbeeCodec::buildWriteAttributesUndividedRequest(
          records, recordCount, g_zclSequence++, payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueIdentifyQuery(NodeEntry* node) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kIdentifyCommandIdentifyQuery;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueTriggerEffect(NodeEntry* node, uint8_t effectIdentifier) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsIdentify) {
    return false;
  }

  const uint8_t commandPayload[] = {effectIdentifier, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kIdentifyCommandTriggerEffect;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterIdentify,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueAddGroup(NodeEntry* node, uint16_t groupId, const char* name) {
  if (node == nullptr || node->endpoint == 0U ||
      (!node->supportsOnOff && !node->supportsLevelControl)) {
    return false;
  }

  uint8_t commandPayload[32] = {0U};
  const uint8_t nameLength =
      (name == nullptr)
          ? 0U
          : static_cast<uint8_t>(strnlen(name, sizeof(commandPayload) - 3U));
  commandPayload[0] = static_cast<uint8_t>(groupId & 0xFFU);
  commandPayload[1] = static_cast<uint8_t>((groupId >> 8U) & 0xFFU);
  commandPayload[2] = nameLength;
  if (nameLength > 0U) {
    memcpy(&commandPayload[3], name, nameLength);
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kGroupsCommandAddGroup;
  if (!ZigbeeCodec::buildZclFrame(
          frame, commandPayload, static_cast<uint8_t>(3U + nameLength), payload,
          &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterGroups,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueGroupOnOffCommand(NodeEntry* node, uint16_t groupId,
                            uint8_t commandId) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff ||
      !node->demoGroupConfigured) {
    return false;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = commandId;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterOnOff,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

bool queueGroupLevelMoveToLevel(NodeEntry* node, uint16_t groupId,
                                uint8_t level) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl ||
      !node->demoGroupConfigured) {
    return false;
  }

  const uint8_t commandPayload[] = {level, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandMoveToLevelWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterLevelControl,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

