lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueGroupLevelStep(NodeEntry* node, uint16_t groupId, bool increase,
                         uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl ||
      !node->demoGroupConfigured) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterLevelControl,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

bool queueDemoGroupEnrollment() {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    NodeEntry& node = g_nodes[i];
    if (!node.used || node.shortAddress == 0U || node.endpoint == 0U ||
        node.demoGroupConfigured ||
        (!node.supportsOnOff && !node.supportsLevelControl)) {
      continue;
    }
    queuedAny = queueAddGroup(&node, kDemoGroupId, "DemoGrp") || queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupOnOff(uint8_t commandId) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny = queueGroupOnOffCommand(&g_nodes[i], kDemoGroupId, commandId) ||
                queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelMoveToLevel(uint8_t level) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelMoveToLevel(&g_nodes[i], kDemoGroupId, level) ||
        queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelStep(bool increase, uint8_t stepSize) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelStep(&g_nodes[i], kDemoGroupId, increase, stepSize) ||
        queuedAny;
  }
  return queuedAny;
}

bool isRemoteControllerDevice(const NodeEntry& node) {
  return node.deviceId == kZigbeeDeviceIdOnOffLightSwitch ||
         node.deviceId == kZigbeeDeviceIdDimmerSwitch;
}

NodeEntry* firstOnOffNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsOnOff && g_nodes[i].endpoint != 0U &&
        !isRemoteControllerDevice(g_nodes[i])) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstLevelNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsLevelControl && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstColorNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsColorControl && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstColorTemperatureNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsColorTemperature && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstIdentifyNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsIdentify && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstJoinedNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

bool clearAllNodes() {
  for (NodeEntry& node : g_nodes) {
    node = NodeEntry{};
  }
  clearAlternateNetworkKey();
  g_nextShortAddress = 0x1000U;
  return persistCoordinatorSecurityState();
}

bool factoryResetCoordinatorSecurity() {
  g_outgoingFrameCountersReady = false;
  if (!g_counterStore.clear()) {
    return false;
  }
  for (NodeEntry& node : g_nodes) {
    node = NodeEntry{};
  }
  clearAlternateNetworkKey();
  g_nextShortAddress = 0x1000U;
  g_outgoingFrameCountersReady = initializeCoordinatorFrameCounters();
  if (g_outgoingFrameCountersReady && !g_radioReady) {
    g_radioReady = g_radio.begin(kChannel, 8);
  }
  return g_outgoingFrameCountersReady && g_radioReady;
}

void clearNodeInterviewState(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  node->lastDirectDeliverAttemptMs = 0U;
  node->haveNodeDescriptor = false;
  node->logicalType = 0U;
  node->macCapabilityFlags = 0U;
  node->manufacturerCode = 0U;
  node->havePowerDescriptor = false;
  node->availablePowerSources = 0U;
  node->currentPowerSource = 0U;
  node->currentPowerSourceLevel = 0U;
  node->haveBasicZclVersion = false;
  node->basicZclVersion = 0U;
  node->haveBasicApplicationVersion = false;
  node->basicApplicationVersion = 0U;
  node->haveBasicStackVersion = false;
  node->basicStackVersion = 0U;
  node->haveBasicHwVersion = false;
  node->basicHwVersion = 0U;
  node->haveBasicPowerSource = false;
  node->basicPowerSource = 0U;
  node->basicManufacturerName[0] = '\0';
  node->basicModelIdentifier[0] = '\0';
  node->basicSwBuildId[0] = '\0';
  node->haveOnOffState = false;
  node->onOffState = false;
  node->haveLevelState = false;
  node->levelState = 0U;
  node->haveTemperatureState = false;
  node->temperatureCentiDegrees = 0;
  node->haveHumidityState = false;
  node->humidityCentiPercent = 0U;
  node->haveCurrentHue = false;
  node->currentHue = 0U;
  node->haveCurrentSaturation = false;
  node->currentSaturation = 0U;
  node->haveColorTemperature = false;
  node->colorTemperatureMireds = 0U;
  node->haveBatteryVoltage = false;
  node->batteryVoltageDecivolts = 0U;
  node->haveBatteryPercentage = false;
  node->batteryPercentageRemainingHalf = 0U;
  node->haveIdentifyTime = false;
  node->identifyTimeSeconds = 0U;
}

