lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
void copyNodeString(char* destination, size_t destinationSize,
                    const ZigbeeAttributeValue& value) {
  if (destination == nullptr || destinationSize == 0U) {
    return;
  }
  destination[0] = '\0';
  if (value.type != ZigbeeZclDataType::kCharString ||
      value.stringValue == nullptr) {
    return;
  }

  size_t copyLength = value.stringLength;
  if (copyLength >= destinationSize) {
    copyLength = destinationSize - 1U;
  }
  memcpy(destination, value.stringValue, copyLength);
  destination[copyLength] = '\0';
}

void printCentiDegrees(int16_t centiDegrees) {
  if (centiDegrees < 0) {
    Serial.print("-");
    centiDegrees = static_cast<int16_t>(-centiDegrees);
  }
  Serial.print(centiDegrees / 100);
  Serial.print(".");
  const uint8_t fraction = static_cast<uint8_t>(centiDegrees % 100);
  if (fraction < 10U) {
    Serial.print("0");
  }
  Serial.print(fraction);
}

void updateNodeAttributeState(NodeEntry* node, uint16_t clusterId,
                              const ZigbeeAttributeValue& value,
                              uint16_t attributeId) {
  if (node == nullptr) {
    return;
  }

  if (clusterId == kZigbeeClusterBasic) {
    switch (attributeId) {
      case 0x0000U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicZclVersion = true;
          node->basicZclVersion = value.data.u8;
        }
        return;
      case 0x0001U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicApplicationVersion = true;
          node->basicApplicationVersion = value.data.u8;
        }
        return;
      case 0x0002U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicStackVersion = true;
          node->basicStackVersion = value.data.u8;
        }
        return;
      case 0x0003U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicHwVersion = true;
          node->basicHwVersion = value.data.u8;
        }
        return;
      case 0x0004U:
        copyNodeString(node->basicManufacturerName,
                       sizeof(node->basicManufacturerName), value);
        return;
      case 0x0005U:
        copyNodeString(node->basicModelIdentifier,
                       sizeof(node->basicModelIdentifier), value);
        return;
      case 0x0007U:
        if (value.type == ZigbeeZclDataType::kUint8) {
          node->haveBasicPowerSource = true;
          node->basicPowerSource = value.data.u8;
        }
        return;
      case 0x4000U:
        copyNodeString(node->basicSwBuildId, sizeof(node->basicSwBuildId),
                       value);
        return;
      default:
        break;
    }
  }

  if (clusterId == kZigbeeClusterOnOff && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kBoolean) {
    node->haveOnOffState = true;
    node->onOffState = value.data.boolValue;
    return;
  }

  if (clusterId == kZigbeeClusterLevelControl && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint8) {
    node->haveLevelState = true;
    node->levelState = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterTemperatureMeasurement &&
      attributeId == 0x0000U && value.type == ZigbeeZclDataType::kInt16) {
    node->haveTemperatureState = true;
    node->temperatureCentiDegrees = value.data.i16;
    return;
  }

  if (clusterId == kZigbeeClusterRelativeHumidityMeasurement &&
      attributeId == 0x0000U && value.type == ZigbeeZclDataType::kUint16) {
    node->haveHumidityState = true;
    node->humidityCentiPercent = value.data.u16;
    return;
  }

  if (clusterId == kZigbeeClusterColorControl && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint8) {
    node->haveCurrentHue = true;
    node->currentHue = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterColorControl && attributeId == 0x0001U &&
      value.type == ZigbeeZclDataType::kUint8) {
    node->haveCurrentSaturation = true;
    node->currentSaturation = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterColorControl && attributeId == 0x0007U &&
      value.type == ZigbeeZclDataType::kUint16) {
    node->haveColorTemperature = true;
    node->colorTemperatureMireds = value.data.u16;
    node->supportsColorTemperature = true;
    return;
  }

  if (clusterId == kZigbeeClusterPowerConfiguration &&
      attributeId == 0x0020U && value.type == ZigbeeZclDataType::kUint8) {
    node->haveBatteryVoltage = true;
    node->batteryVoltageDecivolts = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterPowerConfiguration &&
      attributeId == 0x0021U && value.type == ZigbeeZclDataType::kUint8) {
    node->haveBatteryPercentage = true;
    node->batteryPercentageRemainingHalf = value.data.u8;
    return;
  }

  if (clusterId == kZigbeeClusterIdentify && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint16) {
    node->haveIdentifyTime = true;
    node->identifyTimeSeconds = value.data.u16;
  }
}

void applyReadAttributeState(NodeEntry* node, uint16_t clusterId,
                             const ZigbeeReadAttributeRecord* records,
                             uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    if (records[i].status != 0x00U) {
      continue;
    }
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

void applyReportedAttributeState(NodeEntry* node, uint16_t clusterId,
                                 const ZigbeeAttributeReportRecord* records,
                                 uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

bool queueNextReportingStep(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  if (node->supportsOnOff && !node->onOffBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterOnOff);
  }
  if (node->supportsOnOff && !node->onOffReportingConfigured) {
    return queueOnOffConfigureReporting(node);
  }
  if (node->supportsLevelControl && !node->levelBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterLevelControl);
  }
  if (node->supportsLevelControl && !node->levelReportingConfigured) {
    return queueLevelConfigureReporting(node);
  }
  if (node->supportsColorControl && !node->colorBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterColorControl);
  }
  if (node->supportsColorControl && !node->colorReportingConfigured) {
    return queueColorConfigureReporting(node);
  }
  if (node->supportsTemperature && !node->temperatureBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterTemperatureMeasurement);
  }
  if (node->supportsTemperature && !node->temperatureReportingConfigured) {
    return queueTemperatureConfigureReporting(node);
  }
  if (node->supportsHumidity && !node->humidityBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterRelativeHumidityMeasurement);
  }
  if (node->supportsHumidity && !node->humidityReportingConfigured) {
    return queueHumidityConfigureReporting(node);
  }
  if (node->supportsPowerConfiguration && !node->powerBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterPowerConfiguration);
  }
  if (node->supportsPowerConfiguration && !node->powerReportingConfigured) {
    return queuePowerConfigureReporting(node);
  }
  return false;
}

void printAttributeValue(const ZigbeeAttributeValue& value) {
  switch (value.type) {
    case ZigbeeZclDataType::kBoolean:
      Serial.print(value.data.boolValue ? "true" : "false");
      break;
    case ZigbeeZclDataType::kBitmap8:
    case ZigbeeZclDataType::kUint8:
      Serial.print(value.data.u8);
      break;
    case ZigbeeZclDataType::kBitmap16:
    case ZigbeeZclDataType::kUint16:
      Serial.print(value.data.u16);
      break;
    case ZigbeeZclDataType::kInt16:
      Serial.print(value.data.i16);
      break;
    case ZigbeeZclDataType::kUint32:
      Serial.print(value.data.u32);
      break;
    case ZigbeeZclDataType::kCharString:
      for (uint8_t i = 0U; i < value.stringLength; ++i) {
        Serial.print(value.stringValue[i]);
      }
      break;
    default:
      Serial.print("unsupported");
      break;
  }
}

