lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
    Serial.print("discover_attr_ext_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" complete=");
    Serial.print(discoveryComplete ? "yes" : "no");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print(" attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(" type=0x");
      Serial.print(static_cast<uint8_t>(records[i].dataType), HEX);
      Serial.print(" access=0x");
      Serial.print(records[i].accessControl, HEX);
    }
    Serial.print("\r\n");
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandConfigureReportingResponse) {
    ZigbeeConfigureReportingStatusRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseConfigureReportingResponse(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }

    bool success = false;
    if (recordCount == 1U && records[0].status == 0x00U &&
        records[0].attributeId == 0U) {
      success = true;
    }
    Serial.print("cfg_reporting_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" status=");
    Serial.print(success ? "OK" : "FAIL");
    for (uint8_t i = 0U; !success && i < recordCount; ++i) {
      Serial.print(" attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(" dir=");
      Serial.print(records[i].direction);
      Serial.print(" code=0x");
      Serial.print(records[i].status, HEX);
    }
    Serial.print("\r\n");
    if (!success) {
      node->stage = NodeStage::kReady;
      return;
    }
    if (aps.clusterId == kZigbeeClusterOnOff) {
      node->onOffReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterLevelControl) {
      node->levelReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterColorControl) {
      node->colorReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterTemperatureMeasurement) {
      node->temperatureReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterRelativeHumidityMeasurement) {
      node->humidityReportingConfigured = true;
    } else if (aps.clusterId == kZigbeeClusterPowerConfiguration) {
      node->powerReportingConfigured = true;
    }
    if (queueReadReportingConfiguration(node, aps.clusterId)) {
      return;
    }
    if (queueNextReportingStep(node)) {
      return;
    }
    node->stage = NodeStage::kReady;
    return;
  }

  if (zcl.frameType == ZigbeeZclFrameType::kGlobal &&
      zcl.commandId == kZclCommandReadReportingConfigurationResponse) {
    ZigbeeReadReportingConfigurationResponseRecord records[8];
    uint8_t recordCount = 0U;
    if (!ZigbeeCodec::parseReadReportingConfigurationResponse(
            zcl.payload, zcl.payloadLength, records,
            static_cast<uint8_t>(sizeof(records) / sizeof(records[0])),
            &recordCount)) {
      return;
    }

    const bool verified =
        reportingConfigurationMatches(aps.clusterId, records, recordCount);
    Serial.print("read_reporting_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" cluster=0x");
    Serial.print(aps.clusterId, HEX);
    Serial.print(" verify=");
    Serial.print(verified ? "OK" : "FAIL");
    for (uint8_t i = 0U; i < recordCount; ++i) {
      Serial.print(" attr=0x");
      Serial.print(records[i].attributeId, HEX);
      Serial.print(" status=0x");
      Serial.print(records[i].status, HEX);
    }
    Serial.print("\r\n");

    if (aps.clusterId == kZigbeeClusterOnOff) {
      node->onOffReportingVerified = verified;
    } else if (aps.clusterId == kZigbeeClusterLevelControl) {
      node->levelReportingVerified = verified;
    } else if (aps.clusterId == kZigbeeClusterColorControl) {
      node->colorReportingVerified = verified;
    } else if (aps.clusterId == kZigbeeClusterTemperatureMeasurement) {
      node->temperatureReportingVerified = verified;
    } else if (aps.clusterId == kZigbeeClusterRelativeHumidityMeasurement) {
      node->humidityReportingVerified = verified;
    } else if (aps.clusterId == kZigbeeClusterPowerConfiguration) {
      node->powerReportingVerified = verified;
    }
    if (queueNextReportingStep(node)) {
      return;
    }
    node->stage = NodeStage::kReady;
    return;
  }

  if (aps.clusterId == kZigbeeClusterIdentify &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific &&
      zcl.commandId == kIdentifyCommandIdentify) {
    node->haveIdentifyTime = true;
    node->identifyTimeSeconds =
        (zcl.payloadLength >= 2U)
            ? static_cast<uint16_t>(zcl.payload[0]) |
                  (static_cast<uint16_t>(zcl.payload[1]) << 8U)
            : 0U;
    Serial.print("identify_query_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" timeout_s=");
    Serial.print(node->identifyTimeSeconds);
    Serial.print("\r\n");
    return;
  }

  if (aps.clusterId == kZigbeeClusterGroups &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific &&
      zcl.commandId == kGroupsCommandAddGroup && zcl.payloadLength >= 3U) {
    const uint8_t status = zcl.payload[0];
    const uint16_t groupId = static_cast<uint16_t>(zcl.payload[1]) |
                             (static_cast<uint16_t>(zcl.payload[2]) << 8U);
    if (status == 0x00U && groupId == kDemoGroupId) {
      node->demoGroupConfigured = true;
    }
    Serial.print("group_add_rsp short=0x");
    Serial.print(node->shortAddress, HEX);
    Serial.print(" group=0x");
    Serial.print(groupId, HEX);
    Serial.print(" status=0x");
    Serial.print(status, HEX);
    Serial.print("\r\n");
    return;
  }

  if (aps.clusterId == kZigbeeClusterOnOff &&
      zcl.frameType == ZigbeeZclFrameType::kClusterSpecific) {
    const char* commandName = "unknown";
    if (zcl.commandId == kOnOffCommandOn) {
      commandName = "on";
    } else if (zcl.commandId == kOnOffCommandOff) {
      commandName = "off";
    } else if (zcl.commandId == kOnOffCommandToggle) {
      commandName = "toggle";
    }

