lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  ZigbeeApsDataFrame aps{};
  ZigbeeApsAcknowledgementFrame ack{};
  if (ZigbeeCodec::parseApsAcknowledgementFrame(nwk.payload, nwk.payloadLength,
                                                &ack) &&
      ack.valid) {
    uint8_t ackSlot = 0U;
    if (findPendingApsAckSlot(*node, ack, &ackSlot)) {
      Serial.print("aps_ack short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" ctr=0x");
      Serial.print(ack.counter, HEX);
      Serial.print(" cluster=0x");
      Serial.print(ack.clusterId, HEX);
      Serial.print("\r\n");
      clearPendingApsAckSlot(node, ackSlot);
    }
    return;
  }
  if (!ZigbeeCodec::parseApsDataFrame(nwk.payload, nwk.payloadLength, &aps) ||
      !aps.valid) {
    return;
  }

  const uint32_t nowMs = millis();
  const bool duplicateAps = isRecentInboundApsDuplicate(node, aps, nowMs);

  if (aps.deliveryMode == kZigbeeApsDeliveryUnicast && aps.ackRequested) {
    (void)sendApsAcknowledgement(node, aps);
  }

  if (aps.profileId == kZigbeeProfileZdo) {
    if (duplicateAps) {
      Serial.print("aps_dup short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(node, aps);
    handleZdoFrame(node, aps);
    return;
  }
  if (aps.profileId == kZigbeeProfileHomeAutomation) {
    if (duplicateAps) {
      Serial.print("aps_dup short=0x");
      Serial.print(node->shortAddress, HEX);
      Serial.print(" cluster=0x");
      Serial.print(aps.clusterId, HEX);
      Serial.print("\r\n");
      return;
    }
    rememberRecentInboundAps(node, aps);
    handleHaFrame(node, aps);
  }
}

void pumpImmediateResponseWindow(uint32_t listenBudgetUs) {
  const uint32_t startUs = micros();
  while (static_cast<uint32_t>(micros() - startUs) < listenBudgetUs) {
    const uint32_t elapsedUs = static_cast<uint32_t>(micros() - startUs);
    const uint32_t remainingUs =
        (elapsedUs < listenBudgetUs) ? (listenBudgetUs - elapsedUs) : 0U;
    if (remainingUs == 0U) {
      break;
    }

    ZigbeeFrame frame{};
    if (!g_radio.receive(&frame, remainingUs, 400000UL)) {
      break;
    }
    processIncomingFrame(frame);
  }
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if ((!g_outgoingFrameCountersReady || !g_radioReady) && ch != 'z' &&
        ch != 'l') {
      Serial.print("security storage unavailable; use z=factory_reset\r\n");
      continue;
    }
    if (ch == 'b') {
      const bool sent = sendBeacon();
      Serial.print("beacon ");
      Serial.print(sent ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'l') {
      listNodes();
    } else if (ch == 'p') {
      g_permitJoinEnabled = true;
      g_permitJoinDeadlineMs = millis() + kPermitJoinWindowMs;
      Serial.print("permit_join open ms=");
      Serial.print(kPermitJoinWindowMs);
      Serial.print("\r\n");
    } else if (ch == 'c') {
      Serial.print(clearAllNodes() ? "nodes cleared\r\n"
                                   : "nodes clear FAIL_CLOSED\r\n");
    } else if (ch == 'z') {
      Serial.print(factoryResetCoordinatorSecurity()
                       ? "security factory reset OK\r\n"
                       : "security factory reset FAIL_CLOSED\r\n");
    } else if (ch == 'x') {
      g_permitJoinEnabled = false;
      g_permitJoinDeadlineMs = 0U;
      Serial.print("permit_join closed\r\n");
    } else if (ch == 'd') {
      NodeEntry* node = firstJoinedNode();
      const bool queued = (node != nullptr) && queueActiveEndpointsRequest(node);
      Serial.print("discover ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'i' || ch == 'e' || ch == 'u' || ch == 'j' || ch == 'w' ||
               ch == 'W' || ch == 's' || ch == 'S' || ch == 'I' ||
               ch == 'R' || ch == 'C') {
      NodeEntry* node = firstIdentifyNode();
      bool queued = false;
      if (ch == 'i') {
        queued = (node != nullptr) && queueIdentifyCommand(node, 5U);
        Serial.print("queue_identify ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" timeout_s=5");
      } else if (ch == 'e') {
        queued =
            (node != nullptr) && queueIdentifyDiscoverAttributesExtended(node);
        Serial.print("queue_identify_discover_attr_ext ");
        Serial.print(queued ? "OK" : "FAIL");
      } else if (ch == 'u') {
        queued =
            (node != nullptr) && queueIdentifyWriteAttributeUndivided(node, 5U, false);
        Serial.print("queue_identify_write_undivided ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" timeout_s=5");
      } else if (ch == 'j') {
        queued =
            (node != nullptr) && queueIdentifyWriteAttributeUndivided(node, 5U, true);
        Serial.print("queue_identify_write_undivided_fail ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" timeout_s=5 attr=0xFFFC");
      } else if (ch == 'w') {
        queued = (node != nullptr) && queueIdentifyWriteAttribute(node, 5U, false);
        Serial.print("queue_identify_write ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" timeout_s=5");
      } else if (ch == 'W') {
        queued = (node != nullptr) && queueIdentifyWriteAttribute(node, 5U, true);
        Serial.print("queue_identify_write_no_rsp ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" timeout_s=5");
      } else if (ch == 's') {
        queued = (node != nullptr) && queueIdentifyQuery(node);
        Serial.print("queue_identify_query ");
        Serial.print(queued ? "OK" : "FAIL");
      } else if (ch == 'S') {
        queued =
            (node != nullptr) && queueTriggerEffect(node, kIdentifyEffectStopEffect);
        Serial.print("queue_trigger_effect ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" effect=stop");
      } else if (ch == 'I') {
        queued = (node != nullptr) && queueTriggerEffect(node, kIdentifyEffectBlink);
        Serial.print("queue_trigger_effect ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" effect=blink");
      } else if (ch == 'R') {
        queued =
            (node != nullptr) && queueTriggerEffect(node, kIdentifyEffectBreathe);
        Serial.print("queue_trigger_effect ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" effect=breathe");
      } else {
        queued = (node != nullptr) &&
                 queueTriggerEffect(node, kIdentifyEffectChannelChange);
        Serial.print("queue_trigger_effect ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" effect=channel_change");
      }
      Serial.print("\r\n");
    } else if (ch == 'v' || ch == 'V') {
      NodeEntry* node = firstJoinedNode();
      const bool requestRejoin = (ch == 'V');
      const bool queued =
          (node != nullptr) && queueMgmtLeaveRequest(node, requestRejoin);
      Serial.print("queue_leave ");
      Serial.print("rejoin=");
      Serial.print(requestRejoin ? "yes " : "no ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'k') {
      (void)queueNetworkKeyUpdateRollout();
      Serial.print("queue_key_update UNSUPPORTED\r\n");
    } else if (ch == 't' || ch == 'o' || ch == 'f') {
      NodeEntry* node = firstOnOffNode();
      uint8_t commandId = kOnOffCommandToggle;
      if (ch == 'o') {
        commandId = kOnOffCommandOn;
      } else if (ch == 'f') {
        commandId = kOnOffCommandOff;
      }
      const bool queued = (node != nullptr) && queueOnOffCommand(node, commandId);
      Serial.print("queue_cmd ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'U' || ch == 'D' || ch == 'M') {
      NodeEntry* node = firstLevelNode();
      bool queued = false;
      if (ch == 'U') {
        queued = (node != nullptr) && queueLevelStep(node, true, 32U);
      } else if (ch == 'D') {
        queued = (node != nullptr) && queueLevelStep(node, false, 32U);
      } else {
        queued = (node != nullptr) && queueLevelMoveToLevel(node, 128U);
      }
      Serial.print("queue_level ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'h' || ch == 'n' || ch == 'B' || ch == 'A' ||
               ch == 'N') {
      bool queued = false;
      if (ch == 'A' || ch == 'N') {
        NodeEntry* node = firstColorTemperatureNode();
        const uint16_t mireds = (ch == 'A') ? 370U : 180U;
        queued = (node != nullptr) && queueColorMoveToTemperature(node, mireds);
        Serial.print("queue_color_temp ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" mireds=");
        Serial.print(mireds);
      } else {
        NodeEntry* node = firstColorNode();
        uint8_t hue = 0U;
        if (ch == 'n') {
          hue = 85U;
        } else if (ch == 'B') {
          hue = 170U;
        }
        queued = (node != nullptr) &&
                 queueColorMoveToHueAndSaturation(node, hue, 254U);
        Serial.print("queue_color_hs ");
        Serial.print(queued ? "OK" : "FAIL");
        Serial.print(" hue=");
        Serial.print(hue);
        Serial.print(" sat=254");
      }
      Serial.print("\r\n");
    } else if (ch == 'g') {
      const bool queued = queueDemoGroupEnrollment();
      Serial.print("queue_group_enroll ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    } else if (ch == 'O' || ch == 'F' || ch == 'T') {
      uint8_t commandId = kOnOffCommandToggle;
      if (ch == 'O') {
        commandId = kOnOffCommandOn;
      } else if (ch == 'F') {
        commandId = kOnOffCommandOff;
      }
      const bool queued = queueDemoGroupOnOff(commandId);
      Serial.print("queue_group_cmd ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    } else if (ch == '+' || ch == '-' || ch == 'm') {
      bool queued = false;
      if (ch == '+') {
        queued = queueDemoGroupLevelStep(true, 32U);
      } else if (ch == '-') {
        queued = queueDemoGroupLevelStep(false, 32U);
      } else {
        queued = queueDemoGroupLevelMoveToLevel(128U);
      }
      Serial.print("queue_group_level ");
      Serial.print(queued ? "OK" : "FAIL");
      Serial.print(" group=0x");
      Serial.print(kDemoGroupId, HEX);
      Serial.print("\r\n");
    }
  }
}

